// ============================================================
// ⚙️ إلمصنعية (أصالة للمجوهرات)
// ============================================================
const CONFIG = {
    //  مصنعية سبائك الذهب (بالريال العُماني)
    goldFees: {
        bar1g: 8.5,
        bar2_5g: 9.5,
        bar5g: 11,
        bar10g: 12.5,
        bar20g: 16.5,
        barOunce: 20.0,
        barTT: 30
    },
    
    //  مصنعية سبائك الفضة (بالريال العُماني)
    silverFees: {
        premium: 2,
        barOunce: 15,
        bar50g: 20,
        bar100g: 25,
        bar250g: 30,
        bar500g: 35,
        barKilo: 50
    }
};
